{
    "Morocco": {
        "qualification method": "Hosts / Group B winners",
        "date of qualification": "27 September 2023\n",
        "apparences": {
            "total": "20th\n",
            "first": "1972\n",
            "last": "2023\n",
            "streak": "5\n"
        },
        "previous best performance": "Champions (1976)\n",
        "WR": "11\n",
        "summary": "The Morocco national football team (Arabic: المنتخب المغربي لكرة القدم) represents Morocco in men's international football. It is controlled by the Royal Moroccan Football Federation (FRMF), the governing body for football in Morocco. It has been affiliated with FIFA since 1960, with CAF since 1959, and with UNAF since 2005. The team is known as the Atlas Lions. They play home matches at the Prince Moulay Abdellah Stadium in Rabat and train at the Mohammed VI Football Complex in Salé.\nMorocco is regarded as one of Africa’s most successful national football teams. They have won four continental titles, including the 1976 African Cup of Nations and the African Nations Championship in 2018, 2020 and 2024. Morocco has also qualified for the FIFA World Cup on seven occasions. In 1986, they made history as the first African team to top a World Cup group and advance to the knockout stage, where they were eliminated 1–0 by eventual runner-up West Germany. Thirty-six years later, at the 2022 FIFA World Cup, Morocco topped a group that included Croatia, Canada and Belgium. They then went on to defeat Spain and Portugal, becoming the first African and first Arab team to reach a World Cup semi-final. They were also the third World Cup semi-finalist from outside Europe or South America. In 2025, Morocco set a world record for the longest winning streak in international football, achieving 19 consecutive victories across all competitions.\nThe Atlas Lions were ranked 10th in the FIFA World Rankings in April 1998. They were Africa’s highest-ranked national team for three consecutive years, from 1997 to 1999, and have again occupied that position since December 2022. As of November 2025, Morocco is ranked 11th in the world.\nMorocco is set to become the second African nation, the second MENA nation, and the first North African nation to host the FIFA World Cup, after being chosen as a co-host for the 2030 edition alongside Portugal and Spain. Morocco has also hosted the Africa Cup of Nations (AFCON) on two occasions, in 1988 and 2025."
    },
    "Burkina Faso": {
        "qualification method": "Group L runners-up",
        "date of qualification": "13 October 2024\n",
        "apparences": {
            "total": "14th\n",
            "first": "1978\n",
            "last": "2023\n",
            "streak": "3\n"
        },
        "previous best performance": "Runners-up (2013)\n",
        "WR": "62\n",
        "summary": "The Burkina Faso national football team (French: Équipe de football du Burkina Faso) represents Burkina Faso in men's international football and is controlled by the Burkinabé Football Federation. They were known as the Upper Volta national football team until 1984, when Upper Volta became Burkina Faso. They finished fourth in the 1998 Africa Cup of Nations, when they hosted the tournament. Their best ever finish in the tournament was the 2013 edition, reaching the final."
    },
    "Cameroon": {
        "qualification method": "Group J winners",
        "date of qualification": "14 October 2024\n",
        "apparences": {
            "total": "22nd\n",
            "first": "1970\n",
            "last": "2023\n",
            "streak": "6\n"
        },
        "previous best performance": "Champions (1984, 1988, 2000, 2002, 2017)\n",
        "WR": "57\n",
        "summary": "The Cameroon national football team (French: Équipe du Cameroun de football), also known as the Indomitable Lions (French: les lions indomptables), represents Cameroon in men's international football. It is controlled by the Fédération Camerounaise de Football, a member of FIFA and its African confederation CAF.\nThe team has qualified for the FIFA World Cup eight times, more than any other African team, and four times in a row between 1990 and 2002. However, the team has only made it out of the group stage once. They were the first African team to reach the quarter-final of the World Cup in 1990, losing to England in extra time. They have also won five Africa Cup of Nations.\nCameroon is the first and, as of 2022, only African country to win against Brazil in tournament play, defeating them in the 2003 Confederations Cup and 2022 FIFA World Cup by identical 1–0 scores."
    },
    "Algeria": {
        "qualification method": "Group E winners",
        "date of qualification": "14 October 2024\n",
        "apparences": {
            "total": "21st\n",
            "first": "1968\n",
            "last": "2023\n",
            "streak": "7\n"
        },
        "previous best performance": "Champions (1990, 2019)\n",
        "WR": "34\n",
        "summary": "The Algeria national football team (Arabic: منتخب الْجَزَائِر لِكُرَّةُ الْقَدَم) represents Algeria in men's international football, and is governed by the Algerian Football Federation. The team plays their home matches at the 5 July Stadium in Algiers and Miloud Hadefi Stadium in Oran. Algeria joined FIFA on 1 January 1964, a year and a half after gaining independence.\nThe North African team has qualified for five FIFA World Cups, in 1982, 1986, 2010, 2014, and 2026. Algeria has won the Africa Cup of Nations twice, as hosts in 1990, and again in Egypt in 2019. They were also champions of the men's football tournament of the 1975 Mediterranean Games,  the men's football tournament of the 1978 All-Africa Games, the 1991 Afro-Asian Cup of Nations, and the 2021 FIFA Arab Cup.\nAlgeria has rivalries with Egypt, Morocco, and Tunisia, while competitive matches have been played against Nigeria, especially in the 1980s, and Mali due to sharing a common border and a long-standing competitive rivalry, and against Senegal. For the Algerians, their biggest victory on the world stage was their 2–1 win against West Germany during the 1982 FIFA World Cup, and in 2014, Algeria became the first African team to score at least four goals in a match at a World Cup, doing so against South Korea."
    },
    "DR Congo": {
        "qualification method": "Group H winners",
        "date of qualification": "15 October 2024\n",
        "apparences": {
            "total": "21st\n",
            "first": "1965\n",
            "last": "2023\n",
            "streak": "2\n"
        },
        "previous best performance": "Champions (1968, 1974)\n",
        "WR": "56\n",
        "summary": "The DR Congo national football team (French: Équipe nationale de football de la République démocratique du Congo), recognised by FIFA as Congo DR and by CAF as DR Congo, represents the Democratic Republic of the Congo in men's international football and it is controlled by the Congolese Association Football Federation. They are nicknamed Les Léopards, meaning The Leopards. The team is a member of FIFA and the Confederation of African Football (CAF). \nDR Congo have been ranked as high as 28th in the FIFA Rankings; as Zaire, they were the first Sub-Saharan African team to qualify for the FIFA World Cup, and twice won the Africa Cup of Nations. They are also one of the most successful teams in the African Nations Championship with two titles, second only to Morocco with three. They are currently ranked 56th in the FIFA Rankings.\nDR Congo have previously competed variously as Belgian Congo, Congo-Kinshasa and Zaïre.  Their appearance at the 1974 FIFA World Cup was as Zaïre."
    },
    "Senegal": {
        "qualification method": "Group L winners",
        "date of qualification": "15 October 2024\n",
        "apparences": {
            "total": "18th\n",
            "first": "1965\n",
            "last": "2023\n",
            "streak": "6\n"
        },
        "previous best performance": "Champions (2021)\n",
        "WR": "19\n",
        "summary": "The Senegal national football team (French: Équipe de football du Senegal), nicknamed Les Lions de la Teranga (meaning: The Lions of Teranga), represents Senegal in men's international association football and is operated by the Senegalese Football Federation.\nOne of Africa's most famous national football teams, Senegal reached the quarter-finals of the 2002 FIFA World Cup, the second team from Africa to do so (after Cameroon in 1990). They managed to upset defending world champions France, finish second in their group, and beat Sweden in extra time in the round of 16, before losing to Turkey in the quarter-finals.\nSenegal's first appearance in the Africa Cup of Nations was in 1965, when they lost 1–0 to Ivory Coast for fourth place. They hosted the 1992 African Cup of Nations, where they made it to the quarter-finals, and finished as runners-up in both 2002 and 2019. Senegal would finally win their first AFCON title in 2021, defeating Egypt in the final on penalties following a 0–0 draw after extra time."
    },
    "Egypt": {
        "qualification method": "Group C winners",
        "date of qualification": "15 October 2024\n",
        "apparences": {
            "total": "27th\n",
            "first": "1957\n",
            "last": "2023\n",
            "streak": "5\n"
        },
        "previous best performance": "Champions (1957, 1959, 1986, 1998, 2006, 2008, 2010)\n",
        "WR": "35\n",
        "summary": "The Egypt national football team (Egyptian Arabic: منتخب مصر لكرة القدم), nicknamed The Pharaohs (Egyptian Arabic: الفراعنة), represents Egypt in men's international football, and is governed by the Egyptian Football Association (EFA), the governing body of football in Egypt.\nEgypt is Africa's oldest national football team and has won the Africa Cup of Nations a record seven times. The team has made three appearances in the FIFA World Cup and was the first-ever African and Middle Eastern team to make such an appearance. \nInternationally, Egypt earned the honour of becoming a bronze medalist at the 2001 FIFA U-20 World Cup in Argentina."
    },
    "Angola": {
        "qualification method": "Group F winners",
        "date of qualification": "15 October 2024\n",
        "apparences": {
            "total": "10th\n",
            "first": "1996\n",
            "last": "2023\n",
            "streak": "2\n"
        },
        "previous best performance": "Quarter-finalists (2008, 2010, 2023)\n",
        "WR": "89\n",
        "summary": "The Angola national football team (Portuguese: Seleção nacional de futebol de Angola) represents Angola in men's international football and is controlled by the Angolan Football Federation and nicknamed as both Palancas Negras (Black Sable antelopes) and Diabos Vermelhos (Red Devils), the team is a member of both FIFA and the Confederation of African Football (CAF).\nAngola reached its highest FIFA ranking of 45th in July 2000. Their greatest accomplishment was qualifying for the 2006 World Cup, their only World Cup to date."
    },
    "Equatorial Guinea": {
        "qualification method": "Group E runners-up",
        "date of qualification": "13 November 2024\n",
        "apparences": {
            "total": "5th\n",
            "first": "2012\n",
            "last": "2023\n",
            "streak": "3\n"
        },
        "previous best performance": "Fourth place (2015)\n",
        "WR": "97\n",
        "summary": "The Equatorial Guinea national football team (Spanish: Selección de fútbol de Guinea Ecuatorial) represents Equatorial Guinea in men's international football and is controlled by the Equatoguinean Football Federation, a member of the Confederation of African Football (CAF).\nThe team has never qualified for the FIFA World Cup, but has qualified for the Africa Cup of Nations on five occasions, the first two times as hosts (in 2012 and 2015). They finished in fourth place in 2015, and reached the quarter-finals in 2012 and 2021."
    },
    "Ivory Coast": {
        "qualification method": "Group G runners-up",
        "date of qualification": "13 November 2024\n",
        "apparences": {
            "total": "26th\n",
            "first": "1965\n",
            "last": "2023\n",
            "streak": "11\n"
        },
        "previous best performance": "Champions (1992, 2015, 2023)\n",
        "WR": "42\n",
        "summary": "The Ivory Coast national football team (French: Équipe de football de Côte d'Ivoire, recognized as the Côte d'Ivoire by FIFA) represents Ivory Coast in men's international football. Nicknamed the Elephants, the team is managed by the Ivorian Football Federation (FIF). The team has won the Africa Cup of Nations three times, in 1992, 2015 and 2024, and has qualified for the FIFA World Cup four times, in 2006, 2010, 2014 and 2026.\nIvory Coast's home colours are all orange. Since 2020 their home games have been played at Alassane Ouattara Stadium, in Abidjan. Prior to this their home ground was Felix Houphouet Boigny Stadium, also in Abidjan. Didier Zokora holds the record for number of caps, with 123. The nation's leading goalscorer is Didier Drogba, who scored 65 goals for the Elephants in 105 appearances."
    },
    "Gabon": {
        "qualification method": "Group B runners-up",
        "date of qualification": "14 November 2024\n",
        "apparences": {
            "total": "9th\n",
            "first": "1994\n",
            "last": "2021\n",
            "streak": "1\n"
        },
        "previous best performance": "Quarter-finalists (1996, 2012)\n",
        "WR": "78\n",
        "summary": "The Gabon national football team (French: Équipe de football du Gabon)  represents Gabon in men's international football. The team's nickname is The Panthers and it is governed by the Gabonese Football Federation. They have never qualified for the FIFA World Cup, but have qualified nine times (as of 2025) for the Africa Cup of Nations. Gabon is a member of both FIFA and Confederation of African Football (CAF)."
    },
    "Uganda": {
        "qualification method": "Group K runners-up",
        "date of qualification": "14 November 2024\n",
        "apparences": {
            "total": "8th\n",
            "first": "1962\n",
            "last": "2019\n",
            "streak": "1\n"
        },
        "previous best performance": "Runners-up (1978)\n",
        "WR": "85\n",
        "summary": "The Uganda National Football Team, also known as The Uganda Cranes or The Uganda Red Devils represents Uganda in international football and is controlled by the Federation of Uganda Football Associations."
    },
    "South Africa": {
        "qualification method": "Group K winners",
        "date of qualification": "14 November 2024\n",
        "apparences": {
            "total": "12th\n",
            "first": "1996\n",
            "last": "2023\n",
            "streak": "2\n"
        },
        "previous best performance": "Champions (1996)\n",
        "WR": "61\n",
        "summary": "The South Africa national football team represents South Africa in men's international football and is run by the South African Football Association, the governing body for football in South Africa. Nicknamed Bafana Bafana (The Boys in Zulu), the team plays at various stadiums around the country. The team is a member of both FIFA and the Confederation of African Football (CAF), is one of the most well-supported national sides in Africa, and are recognised by their traditional yellow-green kits.\nHaving played their first match in 1906, South Africa returned to the world stage in 1992, after sixteen years of being banned from FIFA, and forty years of effective suspension due to the apartheid system. South Africa have qualified for the FIFA World Cup three times: 1998, 2002 and 2026, in addition to qualifying as hosts of the 2010 tournament, becoming the first African nation to do so. Despite defeating France 2–1 in their final game of the group stage, they failed to progress from the first round of the tournament, becoming the first host nation in the history of the FIFA World Cup to exit in the group stage, followed by Qatar in 2022. As of December 2024, the team is ranked 10th in Africa (CAF) and 57th in FIFA overall.\nSouth Africa's most significant achievement came in 1996 when they hosted and won the Africa Cup of Nations (AFCON). They reached the final again in 1998 but were defeated by Egypt."
    },
    "Tunisia": {
        "qualification method": "Group A runners-up",
        "date of qualification": "14 November 2024\n",
        "apparences": {
            "total": "22nd\n",
            "first": "1962\n",
            "last": "2023\n",
            "streak": "17\n"
        },
        "previous best performance": "Champions (2004)\n",
        "WR": "41\n",
        "summary": "The Tunisia national football team, represents Tunisia in men's international association football competitions, and is controlled by the Tunisian Football Federation (TFF). The team competes under the Confederation of African Football (CAF) on the continental level, and is affiliated with FIFA for global competitions. Additionally, the team is a member of the Union of North African Football (UNAF) and the Union of Arab Football Associations (UAFA). The team is colloquially known as Eagles of Carthage by fans and the media, with the bald eagle serving as its symbol. Their home kit is primarily white and their away kit is red, which is a reference to the national flag of the country. The team has qualified for the FIFA World Cup six times and the Africa Cup of Nations 21 times, and has appeared in four editions of Summer Olympics and participated once in the FIFA Confederation Cup. Since 2001, Tunisia's home stadium is the Hammadi Agrebi Stadium in Radès, Tunis.\nTunisia's first match after independence was against Libya, which they won 4–2. The team qualified for the FIFA World Cup for the first time in 1978 as the only representative of the continent, and became the first African and Arab team to win a World Cup match by beating Mexico 3–1 in the first game. Tunisia holds the most consecutive appearances in the Africa Cup of Nations, with 17, qualifying for every tournament between 1994 and 2025. By winning the 2004 African Cup of Nations, they qualified for the 2005 FIFA Confederations Cup and was eliminated in the group stage. The team qualified twice for the African Nations Championship, winning the title in their first appearance in 2011, while also competing in the FIFA Arab Cup three times, winning the title in the inaugural edition in 1963 and finishing second in 2021. Radhi Jaïdi, with 105 international matches, holds the record for the number of matches played for Tunisia while Issam Jemâa, with 36 goals, is their all-time highest scorer. Their highest-ever FIFA Men's World Ranking was 14th in April and May 2018, while their lowest rank was 65th in July 2010. \nOn 13 October 2025, Tunisia became the first team in history to qualify for the World Cup without conceding a goal, during the 2026 World Cup qualifying campaign. Sami Trabelsi is the current head coach since 10 February 2025."
    },
    "Nigeria": {
        "qualification method": "Group D winners",
        "date of qualification": "14 November 2024\n",
        "apparences": {
            "total": "21st\n",
            "first": "1963\n",
            "last": "2023\n",
            "streak": "4\n"
        },
        "previous best performance": "Champions (1980, 1994, 2013)\n",
        "WR": "38\n",
        "summary": "The Nigeria national football team represents Nigeria in international men's football. Governed by the Nigeria Football Federation (NFF), they are three-time Africa Cup of Nations (AFCON) winners, with their most recent title in 2013. In February 2024, the Nigerian national football team was ranked 28th in the FIFA rankings. The team has qualified for six of the last nine FIFA World Cups, missing only the 2006, 2022 and 2026 tournaments. They have reached the round of 16 on three occasions. Their first World Cup appearance was in the 1994 edition. The team is a member of FIFA and Confederation of African Football (CAF)."
    },
    "Mali": {
        "qualification method": "Group I winners",
        "date of qualification": "15 November 2024\n",
        "apparences": {
            "total": "14th\n",
            "first": "1972\n",
            "last": "2023\n",
            "streak": "10\n"
        },
        "previous best performance": "Runners-up (1972)\n",
        "WR": "53\n",
        "summary": "The Mali national football team (Bambara:  Mali jamana ntolatantɔn, French: Équipe du Mali de football) represents Mali in men's international football and is governed by the Malian Football Federation. The team's nickname is Les Aigles. They represent the country at tournaments organized by both FIFA and the Confederation of African Football (CAF).\nWhile Mali is a major youth football power in both Africa and the world, they have never qualified for any senior FIFA World Cup finals in history. They have qualified for the Africa Cup of Nations on 14 occasions.\nMali were suspended by FIFA on 17 March 2017 due to 'government interference' with the national football association, namely dissolving its executive committee. However, the side was re-instated by FIFA on 29 April after the executive committee was re-introduced by the Malian government."
    },
    "Zambia": {
        "qualification method": "Group G winners",
        "date of qualification": "15 November 2024\n",
        "apparences": {
            "total": "19th\n",
            "first": "1974\n",
            "last": "2023\n",
            "streak": "2\n"
        },
        "previous best performance": "Champions (2012)\n",
        "WR": "91\n",
        "summary": "The Zambia national football team represents Zambia in men's association football and is governed by the Football Association of Zambia (FAZ). During the 1980s, they were known as the KK 11, after founding president Dr. Kenneth Kaunda (\"KK\") who ruled Zambia from 1964 to 1991. After the country adopted multiparty politics, the side was nicknamed Chipolopolo which means the \"Copper Bullets\". The team won an Africa Cup of Nations title in 2012. This team has also become the most successful team in the COSAFA Cup, surpassing Zimbabwe after winning the 2023 edition."
    },
    "Zimbabwe": {
        "qualification method": "Group J runners-up",
        "date of qualification": "15 November 2024\n",
        "apparences": {
            "total": "6th\n",
            "first": "2004\n",
            "last": "2021\n",
            "streak": "1\n"
        },
        "previous best performance": "Group stage (2004, 2006, 2017, 2019, 2021)\n",
        "WR": "129\n",
        "summary": "The Zimbabwe national football team (nicknamed The Warriors) represents Zimbabwe in men's international football and is controlled by the Zimbabwe Football Association (ZIFA), formerly known as the Football Association of Rhodesia. The team has never qualified for the FIFA World Cup finals, but has qualified for the Africa Cup of Nations six times. Zimbabwe has also won the COSAFA Cup six times. The team represents both FIFA and the Confederation of African Football (CAF)."
    },
    "Comoros": {
        "qualification method": "Group A winners",
        "date of qualification": "15 November 2024\n",
        "apparences": {
            "total": "2nd\n",
            "first": "2021\n",
            "last": "2021\n",
            "streak": "1\n"
        },
        "previous best performance": "Round of 16 (2021)\n",
        "WR": "109\n",
        "summary": "The Comoros national football team represents the Comoros in international football and is controlled by the Comoros Football Federation. It was formed in 1979, joined the Confederation of African Football (CAF) in 2003, and became a FIFA member in 2005. Comoros qualified for their first major tournament in 2021, after their 0–0 draw with Togo assured them of a place in the 2021 Africa Cup of Nations."
    },
    "Sudan": {
        "qualification method": "Group F runners-up",
        "date of qualification": "18 November 2024\n",
        "apparences": {
            "total": "10th\n",
            "first": "1957\n",
            "last": "2021\n",
            "streak": "1\n"
        },
        "previous best performance": "Champions (1970)\n",
        "WR": "117\n",
        "summary": "The Sudan national football team (Arabic: مُنْتَخَب السُّودَان الْوَطَنِيّ لِكُرَّةُ الْقَدَم, romanized: muntaḵab as-sūdān al-waṭaniyy likurratu l-qadam) represents Sudan in international football and is controlled by the Sudan Football Association, the governing body for football in Sudan. Its home ground is Khartoum Stadium in the capital Khartoum. In 1957, it was one of the three teams to participate in the inaugural Africa Cup of Nations, the other two being Egypt and Ethiopia.\nSudan is one of the oldest teams in Africa and won the 1970 Africa Cup of Nations as hosts."
    },
    "Benin": {
        "qualification method": "Group D runners-up",
        "date of qualification": "18 November 2024\n",
        "apparences": {
            "total": "5th\n",
            "first": "2004\n",
            "last": "2019\n",
            "streak": "1\n"
        },
        "previous best performance": "Quarter-finalists (2019)\n",
        "WR": "92\n",
        "summary": "The Benin national football team (French: Équipe nationale de Football du Bénin), nicknamed Les Guépards (The Cheetahs), represents Benin in men's international association football and are controlled by the Benin Football Federation. They were known as Dahomey until 1975, when the Republic of Dahomey became Benin.\nBenin have been affiliated with FIFA since 1962 and are a member of the Confederation of African Football since 1969. They have never qualified for the World Cup, but have participated at four Africa Cups of Nations in 2004, 2008, 2010 and 2019, never placing in the top two in the group stage at all of these occasions. However, Benin has a unique record as the country is the first national team to reach the quarter-finals of an AFCON edition without gaining a single win in their AFCON history."
    },
    "Tanzania": {
        "qualification method": "Group H runners-up",
        "date of qualification": "19 November 2024\n",
        "apparences": {
            "total": "4th\n",
            "first": "1980\n",
            "last": "2023\n",
            "streak": "2\n"
        },
        "previous best performance": "Group stage (1980, 2019, 2023)\n",
        "WR": "112\n",
        "summary": "The Tanzania national football team (Swahili: Timu ya Taifa ya Mpira wa Miguu ya Tanzania) represents Tanzania in men's international football and is controlled by the Tanzania Football Federation, the governing body for football in Tanzania, Tanzania's home ground is Benjamin Mkapa National Stadium in Dar es Salaam and their head coach is Hemed Morocco from Tanzania. They are colloquially known as the Taifa Stars. Tanzania has never qualified for the FIFA World Cup. Before uniting with Zanzibar, the team played as the Tanganyika national football team. The team represents both FIFA and Confederation of African Football (CAF).\nThe island of Zanzibar, part of Tanzania (and once an independent nation), is also an associate member of CAF and has played matches with other nations, but is not eligible to enter the World Cup or Africa Cup of Nations. See Zanzibar national football team."
    },
    "Botswana": {
        "qualification method": "Group C runners-up",
        "date of qualification": "19 November 2024\n",
        "apparences": {
            "total": "2nd\n",
            "first": "2012\n",
            "last": "2012\n",
            "streak": "1\n"
        },
        "previous best performance": "Group stage (2012)\n",
        "WR": "138\n",
        "summary": "The Botswana national football team (Tswana: Setlhopha sa bosetšhaba sa kgwele ya dinao sa Botswana) was founded in 1970 to represent Botswana in association football and is governed by the Botswana Football Association (BFA). The team has qualified for two Africa Cup of Nations tournaments, in 2012 and 2025."
    },
    "Mozambique": {
        "qualification method": "Group I runners-up",
        "date of qualification": "19 November 2024\n",
        "apparences": {
            "total": "6th\n",
            "first": "1986\n",
            "last": "2023\n",
            "streak": "2\n"
        },
        "previous best performance": "Group stage (1986, 1996, 1998, 2010, 2023)\n",
        "WR": "102\n",
        "summary": "The Mozambique national football team (Portuguese: Seleção Moçambicana de Futebol) represents Mozambique in men's international football competitions and is controlled by the Mozambican Football Federation, the governing body for football in Mozambique. Mozambique have never qualified for a FIFA World Cup, but they have qualified for six Africa Cup of Nations, in 1986, 1996, 1998, 2010, 2023, and most recently 2025, being eliminated in the first round in all five appearances so far. They have also appeared at the African Nations Championship on two occasions where, at the 2022 edition, they claimed their first ever victory and reached the knockout stage of an 11-aside CAF tournament for the first time history. In 1997, the Mozambique Football Federation became a founding member of COSAFA.\nMozambique's home ground is Estádio do Zimpeto in Zimpeto in the capital city Maputo, and can hold 42,000 spectators. The team's current head coach is former player Chiquinho Conde, who became manager in July 2019, replacing previous head coach and former Portugal international Abel Xavier, who had been in charge since February 2016."
    }
}